In [ ]:
#Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes

In [2]:
import pandas as pd
import sqlalchemy as alch

In [3]:
from getpass import getpass
password = getpass("Introduce your sql password: ")

Introduce your sql password: ········

In [4]:
dbName="sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)
print("I AM INNNNNN!!!!")

I AM INNNNNN!!!!

In [ ]:
#Check the number of rentals for each customer for May

In [5]:
df = pd.read_sql_query(
"""
select customer_id, count(rental_id) as num_rentals
from rentals_jun
group by customer_id
order by num_rentals desc;
""", engine)

In [6]:
df.head()

   customer_id  num_rentals
0           31           11
1          454           10
2          329            9
3          295            9
4          561            9

In [ ]:
#Check the number of rentals for each customer for June

In [8]:
df2 = pd.read_sql_query(
"""
select customer_id, count(rental_id) as num_rentals
from rentals_may
group by customer_id
order by num_rentals desc;
""", engine)
df2.head()

   customer_id  num_rentals
0          197            8
1          506            7
2          109            7
3          269            6
4          239            6

In [12]:
new_df = df.merge(df2, how='inner', on='customer_id')
new_df

     customer_id  num_rentals_x  num_rentals_y
0            197              8              8
1            506              7              7
2            109              7              7
3            269              6              6
4            239              6              6
..           ...            ...            ...
515          431              1              1
516          351              1              1
517           10              1              1
518          136              1              1
519           61              1              1

[520 rows x 3 columns]

In [13]:
new_df = new_df.rename(columns={"num_rentals_x":"num_rentals_May","num_rentals_y":"num_rentals_Jun"})
new_df

     customer_id  num_rentals_May  num_rentals_Jun
0            197                8                8
1            506                7                7
2            109                7                7
3            269                6                6
4            239                6                6
..           ...              ...              ...
515          431                1                1
516          351                1                1
517           10                1                1
518          136                1                1
519           61                1                1

[520 rows x 3 columns]